reddit/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hello"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "j5yaYNMU2mbWxaeMdL3ksA"], ["updated_at", "2021-07-30 20:07:33.161814"], ["id", 1]]