reddit/app/controllers/posts_controller.rb

    def create
        @post = Post.new(posts_params)
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "hello"], ["url", "world"], ["content", "why"], ["sub_id", 2], ["author_id", 3], ["created_at", "2021-07-30 21:21:07.796387"], ["updated_at", "2021-07-30 21:21:07.796387"]]

    def show
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]