reddit/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(subs_params)
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Greatest Cats Ever"], ["description", "Cats"], ["moderator_id", 3], ["created_at", "2021-07-30 20:21:08.786887"], ["updated_at", "2021-07-30 20:21:08.786887"]]

    def index
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"

    def show
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @sub = Sub.find(params[:id])

        if @sub.update(subs_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Greatest Birds Ever"], ["description", "Biiiiiiiiiiird"], ["updated_at", "2021-07-30 20:35:58.499746"], ["id", 1]]