reddit/app/views/subs/index.html.erb

<% @subs.each do |sub| %>
<li><%= sub.title %><br><%= sub.description%><br><%="by #{ (User.find_by(id: sub.moderator_id)).username}"%></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]